analogdevicesinc/aducm355-examples/inc/ADuCM355_bitm.h
/* ============================================================================================================================
        
   ============================================================================================================================ */

/* ============================================================================================================================
        UART0
   ============================================================================================================================ */
#define REG_UART0_COMRX                      0x40005000            /*  UART0 Receive Buffer Register */
#define REG_UART0_COMTX                      0x40005000            /*  UART0 Transmit Holding Register */
#define REG_UART0_COMIEN                     0x40005004            /*  UART0 Interrupt Enable */
#define REG_UART0_COMIIR                     0x40005008            /*  UART0 Interrupt ID */
#define REG_UART0_COMLCR                     0x4000500C            /*  UART0 Line Control */
#define REG_UART0_COMMCR                     0x40005010            /*  UART0 Modem Control */
#define REG_UART0_COMLSR                     0x40005014            /*  UART0 Line Status */
#define REG_UART0_COMMSR                     0x40005018            /*  UART0 Modem Status */
#define REG_UART0_COMSCR                     0x4000501C            /*  UART0 Scratch buffer */
#define REG_UART0_COMFCR                     0x40005020            /*  UART0 FIFO Control */
#define REG_UART0_COMFBR                     0x40005024            /*  UART0 Fractional Baud Rate */
#define REG_UART0_COMDIV                     0x40005028            /*  UART0 Baudrate divider */
#define REG_UART0_COMLCR2                    0x4000502C            /*  UART0 Second Line Control */
#define REG_UART0_COMCTL                     0x40005030            /*  UART0 UART control register */
#define REG_UART0_COMRFC                     0x40005034            /*  UART0 RX FIFO byte count */
#define REG_UART0_COMTFC                     0x40005038            /*  UART0 TX FIFO byte count */
#define REG_UART0_COMRSC                     0x4000503C            /*  UART0 RS485 half-duplex Control */
#define REG_UART0_COMACR                     0x40005040            /*  UART0 Auto Baud Control */
#define REG_UART0_COMASRL                    0x40005044            /*  UART0 Auto Baud Status (Low) */
#define REG_UART0_COMASRH                    0x40005048            /*  UART0 Auto Baud Status (High) */

/* ============================================================================================================================
        UART Register BitMasks, Positions & Enumerations 
   ============================================================================================================================ */
/* -------------------------------------------------------------------------------------------------------------------------
          UART_COMRX                           Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_UART_COMRX_RBR                   0            /*  Receive Buffer Register */
#define BITM_UART_COMRX_RBR                  (_ADI_MSK_3(0x000000FF,0x000000FFU, uint16_t  ))    /*  Receive Buffer Register */

/* -------------------------------------------------------------------------------------------------------------------------
          UART_COMTX                           Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_UART_COMTX_THR                   0            /*  Transmit Holding Register */
#define BITM_UART_COMTX_THR                  (_ADI_MSK_3(0x000000FF,0x000000FFU, uint16_t  ))    /*  Transmit Holding Register */

/* -------------------------------------------------------------------------------------------------------------------------
          UART_COMIEN                          Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_UART_COMIEN_EDMAR                5            /*  DMA requests in receive mode */
#define BITP_UART_COMIEN_EDMAT                4            /*  DMA requests in transmit mode */
#define BITP_UART_COMIEN_EDSSI                3            /*  Modem status interrupt */
#define BITP_UART_COMIEN_ELSI                 2            /*  Rx status interrupt */
#define BITP_UART_COMIEN_ETBEI                1            /*  Transmit buffer empty interrupt */
#define BITP_UART_COMIEN_ERBFI                0            /*  Receive buffer full interrupt */
#define BITM_UART_COMIEN_EDMAR               (_ADI_MSK_3(0x00000020,0x00000020U, uint16_t  ))    /*  DMA requests in receive mode */
#define BITM_UART_COMIEN_EDMAT               (_ADI_MSK_3(0x00000010,0x00000010U, uint16_t  ))    /*  DMA requests in transmit mode */
#define BITM_UART_COMIEN_EDSSI               (_ADI_MSK_3(0x00000008,0x00000008U, uint16_t  ))    /*  Modem status interrupt */
#define BITM_UART_COMIEN_ELSI                (_ADI_MSK_3(0x00000004,0x00000004U, uint16_t  ))    /*  Rx status interrupt */
#define BITM_UART_COMIEN_ETBEI               (_ADI_MSK_3(0x00000002,0x00000002U, uint16_t  ))    /*  Transmit buffer empty interrupt */
#define BITM_UART_COMIEN_ERBFI               (_ADI_MSK_3(0x00000001,0x00000001U, uint16_t  ))    /*  Receive buffer full interrupt */

/* -------------------------------------------------------------------------------------------------------------------------
          UART_COMIIR                          Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_UART_COMIIR_FEND                 6            /*  FIFO enabled */
#define BITP_UART_COMIIR_STA                  1            /*  Interrupt status */
#define BITP_UART_COMIIR_NIRQ                 0            /*  Interrupt flag */
#define BITM_UART_COMIIR_FEND                (_ADI_MSK_3(0x000000C0,0x000000C0U, uint16_t  ))    /*  FIFO enabled */
#define BITM_UART_COMIIR_STA                 (_ADI_MSK_3(0x0000000E,0x0000000EU, uint16_t  ))    /*  Interrupt status */
#define BITM_UART_COMIIR_NIRQ                (_ADI_MSK_3(0x00000001,0x00000001U, uint16_t  ))    /*  Interrupt flag */

/* -------------------------------------------------------------------------------------------------------------------------
          UART_COMLCR                          Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_UART_COMLCR_BRK                  6            /*  Set Break */
#define BITP_UART_COMLCR_SP                   5            /*  Stick Parity */
#define BITP_UART_COMLCR_EPS                  4            /*  Parity Select */
#define BITP_UART_COMLCR_PEN                  3            /*  Parity Enable */
#define BITP_UART_COMLCR_STOP                 2            /*  Stop Bit */
#define BITP_UART_COMLCR_WLS                  0            /*  Word Length Select */
#define BITM_UART_COMLCR_BRK                 (_ADI_MSK_3(0x00000040,0x00000040U, uint16_t  ))    /*  Set Break */
#define BITM_UART_COMLCR_SP                  (_ADI_MSK_3(0x00000020,0x00000020U, uint16_t  ))    /*  Stick Parity */
#define BITM_UART_COMLCR_EPS                 (_ADI_MSK_3(0x00000010,0x00000010U, uint16_t  ))    /*  Parity Select */
#define BITM_UART_COMLCR_PEN                 (_ADI_MSK_3(0x00000008,0x00000008U, uint16_t  ))    /*  Parity Enable */
#define BITM_UART_COMLCR_STOP                (_ADI_MSK_3(0x00000004,0x00000004U, uint16_t  ))    /*  Stop Bit */
#define BITM_UART_COMLCR_WLS                 (_ADI_MSK_3(0x00000003,0x00000003U, uint16_t  ))    /*  Word Length Select */

/* -------------------------------------------------------------------------------------------------------------------------
          UART_COMMCR                          Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_UART_COMMCR_LOOPBACK             4            /*  Loopback mode */
#define BITP_UART_COMMCR_OUT2                 3            /*  Output 2 */
#define BITP_UART_COMMCR_OUT1                 2            /*  Output 1 */
#define BITP_UART_COMMCR_RTS                  1            /*  Request to send */
#define BITP_UART_COMMCR_DTR                  0            /*  Data Terminal Ready */
#define BITM_UART_COMMCR_LOOPBACK            (_ADI_MSK_3(0x00000010,0x00000010U, uint16_t  ))    /*  Loopback mode */
#define BITM_UART_COMMCR_OUT2                (_ADI_MSK_3(0x00000008,0x00000008U, uint16_t  ))    /*  Output 2 */
#define BITM_UART_COMMCR_OUT1                (_ADI_MSK_3(0x00000004,0x00000004U, uint16_t  ))    /*  Output 1 */
#define BITM_UART_COMMCR_RTS                 (_ADI_MSK_3(0x00000002,0x00000002U, uint16_t  ))    /*  Request to send */
#define BITM_UART_COMMCR_DTR                 (_ADI_MSK_3(0x00000001,0x00000001U, uint16_t  ))    /*  Data Terminal Ready */

/* -------------------------------------------------------------------------------------------------------------------------
          UART_COMLSR                          Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_UART_COMLSR_FIFOERR              7            /*  data byte(s) in RX FIFO have either parity error, frame error or break indication. only used in 16550 mode; Read-clear if no more error in RX FIFO */
#define BITP_UART_COMLSR_TEMT                 6            /*  COMTX and Shift Register Empty Status */
#define BITP_UART_COMLSR_THRE                 5            /*  COMTX Empty */
#define BITP_UART_COMLSR_BI                   4            /*  Break Indicator */
#define BITP_UART_COMLSR_FE                   3            /*  Framing Error */
#define BITP_UART_COMLSR_PE                   2            /*  Parity Error */
#define BITP_UART_COMLSR_OE                   1            /*  Overrun Error */
#define BITP_UART_COMLSR_DR                   0            /*  Data Ready */
#define BITM_UART_COMLSR_FIFOERR             (_ADI_MSK_3(0x00000080,0x00000080U, uint16_t  ))    /*  data byte(s) in RX FIFO have either parity error, frame error or break indication. only used in 16550 mode; Read-clear if no more error in RX FIFO */
#define BITM_UART_COMLSR_TEMT                (_ADI_MSK_3(0x00000040,0x00000040U, uint16_t  ))    /*  COMTX and Shift Register Empty Status */
#define BITM_UART_COMLSR_THRE                (_ADI_MSK_3(0x00000020,0x00000020U, uint16_t  ))    /*  COMTX Empty */
#define BITM_UART_COMLSR_BI                  (_ADI_MSK_3(0x00000010,0x00000010U, uint16_t  ))    /*  Break Indicator */
#define BITM_UART_COMLSR_FE                  (_ADI_MSK_3(0x00000008,0x00000008U, uint16_t  ))    /*  Framing Error */
#define BITM_UART_COMLSR_PE                  (_ADI_MSK_3(0x00000004,0x00000004U, uint16_t  ))    /*  Parity Error */
#define BITM_UART_COMLSR_OE                  (_ADI_MSK_3(0x00000002,0x00000002U, uint16_t  ))    /*  Overrun Error */
#define BITM_UART_COMLSR_DR                  (_ADI_MSK_3(0x00000001,0x00000001U, uint16_t  ))    /*  Data Ready */

/* -------------------------------------------------------------------------------------------------------------------------
          UART_COMMSR                          Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_UART_COMMSR_DCD                  7            /*  Data Carrier Detect */
#define BITP_UART_COMMSR_RI                   6            /*  Ring Indicator */
#define BITP_UART_COMMSR_DSR                  5            /*  Data Set Ready */
#define BITP_UART_COMMSR_CTS                  4            /*  Clear To Send */
#define BITP_UART_COMMSR_DDCD                 3            /*  Delta DCD */
#define BITP_UART_COMMSR_TERI                 2            /*  Trailing Edge RI */
#define BITP_UART_COMMSR_DDSR                 1            /*  Delta DSR */
#define BITP_UART_COMMSR_DCTS                 0            /*  Delta CTS */
#define BITM_UART_COMMSR_DCD                 (_ADI_MSK_3(0x00000080,0x00000080U, uint16_t  ))    /*  Data Carrier Detect */
#define BITM_UART_COMMSR_RI                  (_ADI_MSK_3(0x00000040,0x00000040U, uint16_t  ))    /*  Ring Indicator */
#define BITM_UART_COMMSR_DSR                 (_ADI_MSK_3(0x00000020,0x00000020U, uint16_t  ))    /*  Data Set Ready */
#define BITM_UART_COMMSR_CTS                 (_ADI_MSK_3(0x00000010,0x00000010U, uint16_t  ))    /*  Clear To Send */
#define BITM_UART_COMMSR_DDCD                (_ADI_MSK_3(0x00000008,0x00000008U, uint16_t  ))    /*  Delta DCD */
#define BITM_UART_COMMSR_TERI                (_ADI_MSK_3(0x00000004,0x00000004U, uint16_t  ))    /*  Trailing Edge RI */
#define BITM_UART_COMMSR_DDSR                (_ADI_MSK_3(0x00000002,0x00000002U, uint16_t  ))    /*  Delta DSR */
#define BITM_UART_COMMSR_DCTS                (_ADI_MSK_3(0x00000001,0x00000001U, uint16_t  ))    /*  Delta CTS */

/* -------------------------------------------------------------------------------------------------------------------------
          UART_COMSCR                          Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_UART_COMSCR_SCR                  0            /*  Scratch */
#define BITM_UART_COMSCR_SCR                 (_ADI_MSK_3(0x000000FF,0x000000FFU, uint16_t  ))    /*  Scratch */

/* -------------------------------------------------------------------------------------------------------------------------
          UART_COMFCR                          Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_UART_COMFCR_RFTRIG               6            /*  RX FIFO Trig level */
#define BITP_UART_COMFCR_FDMAMD               3            /*  FIFO DMA mode */
#define BITP_UART_COMFCR_TFCLR                2            /*  clear TX FIFO */
#define BITP_UART_COMFCR_RFCLR                1            /*  clear RX FIFO */
#define BITP_UART_COMFCR_FIFOEN               0            /*  FIFO enable as to work in 16550 mode */
#define BITM_UART_COMFCR_RFTRIG              (_ADI_MSK_3(0x000000C0,0x000000C0U, uint16_t  ))    /*  RX FIFO Trig level */
#define BITM_UART_COMFCR_FDMAMD              (_ADI_MSK_3(0x00000008,0x00000008U, uint16_t  ))    /*  FIFO DMA mode */
#define BITM_UART_COMFCR_TFCLR               (_ADI_MSK_3(0x00000004,0x00000004U, uint16_t  ))    /*  clear TX FIFO */
#define BITM_UART_COMFCR_RFCLR               (_ADI_MSK_3(0x00000002,0x00000002U, uint16_t  ))    /*  clear RX FIFO */
#define BITM_UART_COMFCR_FIFOEN              (_ADI_MSK_3(0x00000001,0x00000001U, uint16_t  ))    /*  FIFO enable as to work in 16550 mode */
#define ENUM_UART_COMFCR_MODE0               (_ADI_MSK_3(0x00000000,0x00000000U, uint16_t  ))    /*  FDMAMD: in DMA mode 0, RX DMA request will be asserted whenever there's data in RBR or RX FIFO and de-assert whenever RBR or RX FIFO is empty; TX DMA request will be asserted whenever THR or TX FIFO is empty and de-assert whenever data written to */
#define ENUM_UART_COMFCR_MODE1               (_ADI_MSK_3(0x00000008,0x00000008U, uint16_t  ))    /*  FDMAMD: in DMA mode 1, RX DMA request will be asserted whenever RX FIFO trig level or time out reached and de-assert thereafter when RX FIFO is empty; TX DMA request will be asserted whenever TX FIFO is empty and de-assert thereafter when TX FIFO is completely filled up full; */

/* -------------------------------------------------------------------------------------------------------------------------
          UART_COMFBR                          Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_UART_COMFBR_FBEN                15            /*  Fractional baud rate generator enable */
#define BITP_UART_COMFBR_DIVM                11            /*  Fractional baud rate M divide bits 1 to 3 */
#define BITP_UART_COMFBR_DIVN                 0            /*  Fractional baud rate N divide bits 0 to 2047. */
#define BITM_UART_COMFBR_FBEN                (_ADI_MSK_3(0x00008000,0x00008000U, uint16_t  ))    /*  Fractional baud rate generator enable */
#define BITM_UART_COMFBR_DIVM                (_ADI_MSK_3(0x00001800,0x00001800U, uint16_t  ))    /*  Fractional baud rate M divide bits 1 to 3 */
#define BITM_UART_COMFBR_DIVN                (_ADI_MSK_3(0x000007FF,0x000007FFU, uint16_t  ))    /*  Fractional baud rate N divide bits 0 to 2047. */

/* -------------------------------------------------------------------------------------------------------------------------
          UART_COMDIV                          Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_UART_COMDIV_DIV                  0            /*  Baud rate divider */
#define BITM_UART_COMDIV_DIV                 (_ADI_MSK_3(0x0000FFFF,0x0000FFFF, int16_t   ))    /*  Baud rate divider */

/* -------------------------------------------------------------------------------------------------------------------------
          UART_COMLCR2                         Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_UART_COMLCR2_OSR                 0            /*  Over Sample Rate */
#define BITM_UART_COMLCR2_OSR                (_ADI_MSK_3(0x00000003,0x00000003U, uint16_t  ))    /*  Over Sample Rate */

/* -------------------------------------------------------------------------------------------------------------------------
          UART_COMCTL                          Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_UART_COMCTL_REV                  8            /*  UART revision ID */
#define BITP_UART_COMCTL_RXINV                4            /*  invert receiver line */
#define BITP_UART_COMCTL_FORCECLKON           1            /*  Force UCLKg on */
#define BITM_UART_COMCTL_REV                 (_ADI_MSK_3(0x0000FF00,0x0000FF00U, uint16_t  ))    /*  UART revision ID */
#define BITM_UART_COMCTL_RXINV               (_ADI_MSK_3(0x00000010,0x00000010U, uint16_t  ))    /*  invert receiver line */
#define BITM_UART_COMCTL_FORCECLKON          (_ADI_MSK_3(0x00000002,0x00000002U, uint16_t  ))    /*  Force UCLKg on */
#define ENUM_UART_COMCTL_EN000               (_ADI_MSK_3(0x00000000,0x00000000U, uint16_t  ))    /*  RXINV: don't invert receiver line (idling high) */
#define ENUM_UART_COMCTL_EN001               (_ADI_MSK_3(0x00000010,0x00000010U, uint16_t  ))    /*  RXINV: invert receiver line (idling low) */

/* -------------------------------------------------------------------------------------------------------------------------
          UART_COMRFC                          Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_UART_COMRFC_RFC                  0            /*  Current RX FIFO data bytes */
#define BITM_UART_COMRFC_RFC                 (_ADI_MSK_3(0x0000001F,0x0000001FU, uint16_t  ))    /*  Current RX FIFO data bytes */

/* -------------------------------------------------------------------------------------------------------------------------
          UART_COMTFC                          Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_UART_COMTFC_TFC                  0            /*  Current TX FIFO data bytes */
#define BITM_UART_COMTFC_TFC                 (_ADI_MSK_3(0x0000001F,0x0000001FU, uint16_t  ))    /*  Current TX FIFO data bytes */

/* -------------------------------------------------------------------------------------------------------------------------
          UART_COMRSC                          Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_UART_COMRSC_DISTX                3            /*  Hold off TX when receiving */
#define BITP_UART_COMRSC_DISRX                2            /*  disable RX when transmitting */
#define BITP_UART_COMRSC_OENSP                1            /*  SOUT_EN de-assert before full stop bit(s) */
#define BITP_UART_COMRSC_OENP                 0            /*  SOUT_EN polarity */
#define BITM_UART_COMRSC_DISTX               (_ADI_MSK_3(0x00000008,0x00000008U, uint16_t  ))    /*  Hold off TX when receiving */
#define BITM_UART_COMRSC_DISRX               (_ADI_MSK_3(0x00000004,0x00000004U, uint16_t  ))    /*  disable RX when transmitting */
#define BITM_UART_COMRSC_OENSP               (_ADI_MSK_3(0x00000002,0x00000002U, uint16_t  ))    /*  SOUT_EN de-assert before full stop bit(s) */
#define BITM_UART_COMRSC_OENP                (_ADI_MSK_3(0x00000001,0x00000001U, uint16_t  ))    /*  SOUT_EN polarity */

/* -------------------------------------------------------------------------------------------------------------------------
          UART_COMACR                          Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_UART_COMACR_EEC                  8            /*  Ending Edge Count */
#define BITP_UART_COMACR_SEC                  4            /*  Starting Edge Count */
#define BITP_UART_COMACR_TOIEN                2            /*  enable time-out interrupt */
#define BITP_UART_COMACR_DNIEN                1            /*  enable done interrupt */
#define BITP_UART_COMACR_ABE                  0            /*  Auto Baud enable */
#define BITM_UART_COMACR_EEC                 (_ADI_MSK_3(0x00000F00,0x00000F00U, uint16_t  ))    /*  Ending Edge Count */
#define BITM_UART_COMACR_SEC                 (_ADI_MSK_3(0x00000070,0x00000070U, uint16_t  ))    /*  Starting Edge Count */
#define BITM_UART_COMACR_TOIEN               (_ADI_MSK_3(0x00000004,0x00000004U, uint16_t  ))    /*  enable time-out interrupt */
#define BITM_UART_COMACR_DNIEN               (_ADI_MSK_3(0x00000002,0x00000002U, uint16_t  ))    /*  enable done interrupt */
#define BITM_UART_COMACR_ABE                 (_ADI_MSK_3(0x00000001,0x00000001U, uint16_t  ))    /*  Auto Baud enable */

