analogdevicesinc/aducm355-examples/inc/ADuCM355_bitm.h
/* -------------------------------------------------------------------------------------------------------------------------
          UART_COMASRL                         Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_UART_COMASRL_CNT                 4            /*  Auto Baud Counter value */
#define BITP_UART_COMASRL_NEETO               3            /*  Timed out due to no valid ending edge found */
#define BITP_UART_COMASRL_NSETO               2            /*  Timed out due to no valid start edge found */
#define BITP_UART_COMASRL_BRKTO               1            /*  Timed out due to long time break condition */
#define BITP_UART_COMASRL_DONE                0            /*  Auto Baud Done successfully */
#define BITM_UART_COMASRL_CNT                (_ADI_MSK_3(0x0000FFF0,0x0000FFF0U, uint16_t  ))    /*  Auto Baud Counter value */
#define BITM_UART_COMASRL_NEETO              (_ADI_MSK_3(0x00000008,0x00000008U, uint16_t  ))    /*  Timed out due to no valid ending edge found */
#define BITM_UART_COMASRL_NSETO              (_ADI_MSK_3(0x00000004,0x00000004U, uint16_t  ))    /*  Timed out due to no valid start edge found */
#define BITM_UART_COMASRL_BRKTO              (_ADI_MSK_3(0x00000002,0x00000002U, uint16_t  ))    /*  Timed out due to long time break condition */
#define BITM_UART_COMASRL_DONE               (_ADI_MSK_3(0x00000001,0x00000001U, uint16_t  ))    /*  Auto Baud Done successfully */

/* -------------------------------------------------------------------------------------------------------------------------
          UART_COMASRH                         Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_UART_COMASRH_CNT                 0            /*  Auto Baud Counter value */
#define BITM_UART_COMASRH_CNT                (_ADI_MSK_3(0x000000FF,0x000000FFU, uint16_t  ))    /*  Auto Baud Counter value */


/* ============================================================================================================================
        DMA
   ============================================================================================================================ */

/* ============================================================================================================================
        DMA0
   ============================================================================================================================ */
#define REG_DMA0_STAT                        0x40010000            /*  DMA0 DMA Status */
#define REG_DMA0_CFG                         0x40010004            /*  DMA0 DMA Configuration */
#define REG_DMA0_PDBPTR                      0x40010008            /*  DMA0 DMA channel primary control data base pointer */
#define REG_DMA0_ADBPTR                      0x4001000C            /*  DMA0 DMA channel alternate control data base pointer */
#define REG_DMA0_SWREQ                       0x40010014            /*  DMA0 DMA channel software request */
#define REG_DMA0_RMSK_SET                    0x40010020            /*  DMA0 DMA channel request mask set */
#define REG_DMA0_RMSK_CLR                    0x40010024            /*  DMA0 DMA channel request mask clear */
#define REG_DMA0_EN_SET                      0x40010028            /*  DMA0 DMA channel enable set */
#define REG_DMA0_EN_CLR                      0x4001002C            /*  DMA0 DMA channel enable clear */
#define REG_DMA0_ALT_SET                     0x40010030            /*  DMA0 DMA channel primary-alternate set */
#define REG_DMA0_ALT_CLR                     0x40010034            /*  DMA0 DMA channel primary-alternate clear */
#define REG_DMA0_PRI_SET                     0x40010038            /*  DMA0 DMA channel priority set */
#define REG_DMA0_PRI_CLR                     0x4001003C            /*  DMA0 DMA channel priority clear */
#define REG_DMA0_ERRCHNL_CLR                 0x40010048            /*  DMA0 DMA Per Channel Error Clear */
#define REG_DMA0_ERR_CLR                     0x4001004C            /*  DMA0 DMA bus error clear */
#define REG_DMA0_INVALIDDESC_CLR             0x40010050            /*  DMA0 DMA Per Channel Invalid Descriptor Clear */
#define REG_DMA0_BS_SET                      0x40010800            /*  DMA0 DMA channel bytes swap enable set */
#define REG_DMA0_BS_CLR                      0x40010804            /*  DMA0 DMA channel bytes swap enable clear */
#define REG_DMA0_SRCADDR_SET                 0x40010810            /*  DMA0 DMA channel source address decrement enable set */
#define REG_DMA0_SRCADDR_CLR                 0x40010814            /*  DMA0 DMA channel source address decrement enable clear */
#define REG_DMA0_DSTADDR_SET                 0x40010818            /*  DMA0 DMA channel destination address decrement enable set */
#define REG_DMA0_DSTADDR_CLR                 0x4001081C            /*  DMA0 DMA channel destination address decrement enable clear */
#define REG_DMA0_REVID                       0x40010FE0            /*  DMA0 DMA Controller Revision ID */

/* ============================================================================================================================
        DMA Register BitMasks, Positions & Enumerations 
   ============================================================================================================================ */
/* -------------------------------------------------------------------------------------------------------------------------
          DMA_STAT                             Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DMA_STAT_CHANM1                 16            /*  Number of available DMA channels minus 1 */
#define BITP_DMA_STAT_MEN                     0            /*  Enable status of the controller */
#define BITM_DMA_STAT_CHANM1                 (_ADI_MSK_3(0x001F0000,0x001F0000UL, uint32_t  ))    /*  Number of available DMA channels minus 1 */
#define BITM_DMA_STAT_MEN                    (_ADI_MSK_3(0x00000001,0x00000001UL, uint32_t  ))    /*  Enable status of the controller */

/* -------------------------------------------------------------------------------------------------------------------------
          DMA_CFG                              Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DMA_CFG_MEN                      0            /*  Controller enable */
#define BITM_DMA_CFG_MEN                     (_ADI_MSK_3(0x00000001,0x00000001UL, uint32_t  ))    /*  Controller enable */

/* -------------------------------------------------------------------------------------------------------------------------
          DMA_PDBPTR                           Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DMA_PDBPTR_ADDR                  0            /*  Pointer to the base address of the primary data structure */
#define BITM_DMA_PDBPTR_ADDR                 (_ADI_MSK_3(0xFFFFFFFF,0xFFFFFFFF, int32_t   ))    /*  Pointer to the base address of the primary data structure */

/* -------------------------------------------------------------------------------------------------------------------------
          DMA_ADBPTR                           Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DMA_ADBPTR_ADDR                  0            /*  Base address of the alternate data structure */
#define BITM_DMA_ADBPTR_ADDR                 (_ADI_MSK_3(0xFFFFFFFF,0xFFFFFFFF, int32_t   ))    /*  Base address of the alternate data structure */

/* -------------------------------------------------------------------------------------------------------------------------
          DMA_SWREQ                            Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DMA_SWREQ_CHAN                   0            /*  Generate software request */
#define BITM_DMA_SWREQ_CHAN                  (_ADI_MSK_3(0x00FFFFFF,0x00FFFFFFUL, uint32_t  ))    /*  Generate software request */

/* -------------------------------------------------------------------------------------------------------------------------
          DMA_RMSK_SET                         Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DMA_RMSK_SET_CHAN                0            /*  Mask requests from DMA channels */
#define BITM_DMA_RMSK_SET_CHAN               (_ADI_MSK_3(0x00FFFFFF,0x00FFFFFFUL, uint32_t  ))    /*  Mask requests from DMA channels */

/* -------------------------------------------------------------------------------------------------------------------------
          DMA_RMSK_CLR                         Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DMA_RMSK_CLR_CHAN                0            /*  Clear Request Mask Set bits */
#define BITM_DMA_RMSK_CLR_CHAN               (_ADI_MSK_3(0x00FFFFFF,0x00FFFFFFUL, uint32_t  ))    /*  Clear Request Mask Set bits */

/* -------------------------------------------------------------------------------------------------------------------------
          DMA_EN_SET                           Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DMA_EN_SET_CHAN                  0            /*  Enable DMA channels */
#define BITM_DMA_EN_SET_CHAN                 (_ADI_MSK_3(0x00FFFFFF,0x00FFFFFFUL, uint32_t  ))    /*  Enable DMA channels */

/* -------------------------------------------------------------------------------------------------------------------------
          DMA_EN_CLR                           Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DMA_EN_CLR_CHAN                  0            /*  Disable DMA channels */
#define BITM_DMA_EN_CLR_CHAN                 (_ADI_MSK_3(0x00FFFFFF,0x00FFFFFFUL, uint32_t  ))    /*  Disable DMA channels */

/* -------------------------------------------------------------------------------------------------------------------------
          DMA_ALT_SET                          Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DMA_ALT_SET_CHAN                 0            /*  Control struct status / select alt struct */
#define BITM_DMA_ALT_SET_CHAN                (_ADI_MSK_3(0x00FFFFFF,0x00FFFFFFUL, uint32_t  ))    /*  Control struct status / select alt struct */

/* -------------------------------------------------------------------------------------------------------------------------
          DMA_ALT_CLR                          Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DMA_ALT_CLR_CHAN                 0            /*  Select primary data struct */
#define BITM_DMA_ALT_CLR_CHAN                (_ADI_MSK_3(0x00FFFFFF,0x00FFFFFFUL, uint32_t  ))    /*  Select primary data struct */

/* -------------------------------------------------------------------------------------------------------------------------
          DMA_PRI_SET                          Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DMA_PRI_SET_CHAN                 0            /*  Configure channel for high priority */
#define BITM_DMA_PRI_SET_CHAN                (_ADI_MSK_3(0x00FFFFFF,0x00FFFFFFUL, uint32_t  ))    /*  Configure channel for high priority */

/* -------------------------------------------------------------------------------------------------------------------------
          DMA_PRI_CLR                          Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DMA_PRI_CLR_CHPRICLR             0            /*  Configure channel for default priority level */
#define BITM_DMA_PRI_CLR_CHPRICLR            (_ADI_MSK_3(0x00FFFFFF,0x00FFFFFFUL, uint32_t  ))    /*  Configure channel for default priority level */

/* -------------------------------------------------------------------------------------------------------------------------
          DMA_ERRCHNL_CLR                      Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DMA_ERRCHNL_CLR_CHAN             0            /*  Per channel Bus error status/ Per channel bus error clear */
#define BITM_DMA_ERRCHNL_CLR_CHAN            (_ADI_MSK_3(0x00FFFFFF,0x00FFFFFFUL, uint32_t  ))    /*  Per channel Bus error status/ Per channel bus error clear */

/* -------------------------------------------------------------------------------------------------------------------------
          DMA_ERR_CLR                          Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DMA_ERR_CLR_CHAN                 0            /*  Bus error status */
#define BITM_DMA_ERR_CLR_CHAN                (_ADI_MSK_3(0x00FFFFFF,0x00FFFFFFUL, uint32_t  ))    /*  Bus error status */

/* -------------------------------------------------------------------------------------------------------------------------
          DMA_INVALIDDESC_CLR                  Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DMA_INVALIDDESC_CLR_CHAN         0            /*  Per channel Invalid Descriptor status/ Per channel Invalid descriptor status clear */
#define BITM_DMA_INVALIDDESC_CLR_CHAN        (_ADI_MSK_3(0x00FFFFFF,0x00FFFFFFUL, uint32_t  ))    /*  Per channel Invalid Descriptor status/ Per channel Invalid descriptor status clear */

/* -------------------------------------------------------------------------------------------------------------------------
          DMA_BS_SET                           Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DMA_BS_SET_CHAN                  0            /*  Byte swap status */
#define BITM_DMA_BS_SET_CHAN                 (_ADI_MSK_3(0x00FFFFFF,0x00FFFFFFUL, uint32_t  ))    /*  Byte swap status */

/* -------------------------------------------------------------------------------------------------------------------------
          DMA_BS_CLR                           Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DMA_BS_CLR_CHAN                  0            /*  Disable byte swap */
#define BITM_DMA_BS_CLR_CHAN                 (_ADI_MSK_3(0x00FFFFFF,0x00FFFFFFUL, uint32_t  ))    /*  Disable byte swap */

/* -------------------------------------------------------------------------------------------------------------------------
          DMA_SRCADDR_SET                      Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DMA_SRCADDR_SET_CHAN             0            /*  Source Address decrement status / configure Source address decrement */
#define BITM_DMA_SRCADDR_SET_CHAN            (_ADI_MSK_3(0x00FFFFFF,0x00FFFFFFUL, uint32_t  ))    /*  Source Address decrement status / configure Source address decrement */

/* -------------------------------------------------------------------------------------------------------------------------
          DMA_SRCADDR_CLR                      Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DMA_SRCADDR_CLR_CHAN             0            /*  Disable source address decrement */
#define BITM_DMA_SRCADDR_CLR_CHAN            (_ADI_MSK_3(0x00FFFFFF,0x00FFFFFFUL, uint32_t  ))    /*  Disable source address decrement */

/* -------------------------------------------------------------------------------------------------------------------------
          DMA_DSTADDR_SET                      Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DMA_DSTADDR_SET_CHAN             0            /*  Destination Address decrement status / configure destination address decrement */
#define BITM_DMA_DSTADDR_SET_CHAN            (_ADI_MSK_3(0x00FFFFFF,0x00FFFFFFUL, uint32_t  ))    /*  Destination Address decrement status / configure destination address decrement */

/* -------------------------------------------------------------------------------------------------------------------------
          DMA_DSTADDR_CLR                      Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DMA_DSTADDR_CLR_CHAN             0            /*  Disable destination address decrement */
#define BITM_DMA_DSTADDR_CLR_CHAN            (_ADI_MSK_3(0x00FFFFFF,0x00FFFFFFUL, uint32_t  ))    /*  Disable destination address decrement */

/* -------------------------------------------------------------------------------------------------------------------------
          DMA_REVID                            Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_DMA_REVID_VALUE                  0            /*  DMA Controller revision ID */
#define BITM_DMA_REVID_VALUE                 (_ADI_MSK_3(0x000000FF,0x000000FFUL, uint32_t  ))    /*  DMA Controller revision ID */


