analogdevicesinc/aducm355-examples/inc/ADuCM355_bitm.h
/* ====================================================================================================
 *    Interrupt Definitions
 * ==================================================================================================== */
#define INTR_RESET                           (-15)		/* Cortex-M3 Reset */
#define INTR_NonMaskableInt                  (-14)		/* Cortex-M3 Non-maskable Interrupt */
#define INTR_HardFault                       (-13)		/* Cortex-M3 Hardware Fault */
#define INTR_MemoryManagement                (-12)		/* Cortex-M3 Memory Management Interrupt */
#define INTR_BusFault                        (-11)		/* Cortex-M3 Bus Fault */
#define INTR_UsageFault                      (-10)		/* Cortex-M3 Usage Fault */
#define INTR_SVCall                          ( -5)		/* Cortex-M3 SVCall Interrupt */
#define INTR_DebugMonitor                    ( -4)		/* Cortex-M3 Debug Monitor */
#define INTR_PendSV                          ( -2)		/* Cortex-M3 PendSV Interrupt */
#define INTR_SysTick                         ( -1)		/* Cortex-M3 SysTick Interrupt */
#define INTR_RTC1_EVT                          0		/* Event */
#define INTR_XINT_EVT1                         2		/* External Wakeup Interrupt n */
#define INTR_AFE_EVT3                          4		/* AFE Interrupt */
#define INTR_WDT_EXP                           5		/* Digital Die Watchdog */
#define INTR_PMG0_VREG_OVR                     6		/* Voltage Regulator (VREG) Overvoltage */
#define INTR_PMG0_BATT_RANGE                   7		/* Battery Voltage (VBAT) Out of Range */
#define INTR_RTC0_EVT                          8		/* RTC0 Event */
#define INTR_SYS_GPIO_INTA                     9		/* GPIO Interrupt A */
#define INTR_SYS_GPIO_INTB                    10		/* GPIO Interrupt B */
#define INTR_TMR0_EVT                         11		/* Event */
#define INTR_TMR1_EVT                         12		/* Event */
#define INTR_FLCC_EVT                         13		/* Event */
#define INTR_UART_EVT                         14		/* Event */
#define INTR_SPI0_EVT                         15		/* Event */
#define INTR_SPI1_EVT                         16		/* SPI1 interrupt */
#define INTR_I2C_SLV_EVT                      17		/* Slave Event */
#define INTR_I2C_MST_EVT                      18		/* Master Event */
#define INTR_DMA_CHAN_ERR                     19		/* DMA Error */
#define INTR_DMA0_CH0_DONE                    20		/* Channel SPI1_TX Done */
#define INTR_DMA0_CH1_DONE                    21		/* Channel SPI1_RX Done */
#define INTR_DMA0_CH2_DONE                    22		/* Channel 2 Done */
#define INTR_DMA0_CH3_DONE                    23		/* Channel 3 Done */
#define INTR_DMA0_CH4_DONE                    24		/* Channel SPI0_TX Done */
#define INTR_DMA0_CH5_DONE                    25		/* Channel SPI0_RX Done */
#define INTR_DMA0_CH6_DONE                    26		/* Channel 6 Done */
#define INTR_DMA0_CH7_DONE                    27		/* Channel 7 Done */
#define INTR_DMA0_CH8_DONE                    28		/* Channel UART_TX Done */
#define INTR_DMA0_CH9_DONE                    29		/* Channel UART_RX Done */
#define INTR_DMA0_CH10_DONE                   30		/* Channel I2C0_STX Done */
#define INTR_DMA0_CH11_DONE                   31		/* Channel I2C0_SRX Done */
#define INTR_DMA0_CH12_DONE                   32		/* Channel I2C0_MX Done */
#define INTR_DMA0_CH13_DONE                   33		/* Channel AES_IN_Done */
#define INTR_DMA0_CH14_DONE                   34		/* Channel AES_OUT_Done */
#define INTR_DMA0_CH15_DONE                   35		/* Channel FLASH0_Done */
#define INTR_CRYPT_EVT                        38		/* Event */
#define INTR_TMR2_EVT                         40		/* Event */
#define INTR_CLKG_PLL_EVT                     43		/* PLL Event */
#define INTR_RNG0_EVT                         44		/* RNG0_EVT */
#define INTR_AFE_ERROR                        47		/* AFE_ERROR */
#define INTR_AFE_ADC                          48		/* AFE_ADC */
#define INTR_AFE_GEN                          49		/* AFE_GEN */
#define INTR_AFE_CMDFIFO                      50		/* AFE_CMDFIFO */
#define INTR_AFE_DATAFIFO                     51		/* AFE_DATAFIFO */
#define INTR_AFE_Watchdog                     52		/* AFE_Watchdog */
#define INTR_AFE_CRC                          53		/* AFE_CRC */
#define INTR_AFE_GPT0                         54		/* AFE_GPT0 */
#define INTR_AFE_GPT1                         55		/* AFE_GPT1 */
#define INTR_DMA0_CH16_DONE                   56		/* AFE_DMA_CMDFIFO */
#define INTR_DMA0_CH17_DONE                   57		/* AFE_DMA_DATAFIFO */
#define INTR_DMA0_CH18_DONE                   58		/* Channel 18 Done */
#define INTR_DMA0_CH19_DONE                   59		/* Channel 19 Done */
#define INTR_DMA0_CH20_DONE                   60		/* Channel 20 Done */
#define INTR_DMA0_CH21_DONE                   61		/* Channel 21 Done */
#define INTR_DMA0_CH22_DONE                   62		/* Channel 22 Done */
#define INTR_DMA0_CH23_DONE                   63		/* Channel 23 Done */
#define INTR_AGPT0_EVT                        64		/* AGPT0_EVT */
#define INTR_AGPT1_EVT                        65		/* AGPT1_EVT */


#if defined (_MISRA_RULES)
#pragma diag(pop)
#endif /* _MISRA_RULES */

#endif	/* end ifndef _DEF_ADUCM355_H */
